BANK_INFO = {
    0: {"name": "بانک توسعه صادرات ایران"},
    1: {"name": "بانک پاسارگاد"},
    2: {"name": "بانک شهر"},
    3: {"name": "بانک توسعه تعاون"},
    4: {"name": "بانک کارآفرین"},
    5: {"name": "بانک دی"},
    6: {"name": "بانک گردشگری"},
    7: {"name": "بانک ایران زمین"},
    8: {"name": "موسسه اعتباری کوثر"},
    9: {"name": "بانک سپه"},
    10: {"name": "بانک رفاه کارگران"},
    11: {"name": "بانک صادرات ایران"},
    12: {"name": "بانک کشاورزی"},
    13: {"name": "بانک ملی ایران"},
    14: {"name": "بانک قرض الحسنه مهر ایران"},
    15: {"name": "بانک ملت"},
    16: {"name": "بانک سامان"},
    17: {"name": "بانک پارسیان"},
    18: {"name": "بانک تجارت"},
    19: {"name": "بانک انصار"},
    20: {"name": "بانک اقتصاد نوین"},
    21: {"name": "پست بانک ایران"},
    22: {"name": "بانک صنعت و معدن"},
    23: {"name": "بانک مسکن"},
    24: {"name": "موسسه اعتباری توسعه"},
    25: {"name": "بانک آینده"},
    26: {"name": "بانک مرکزی"},
    27: {"name": "بانک حکمت ایرانیان"},
    28: {"name": "بانک سینا"},
    29: {"name": "بانک مهر اقتصاد"},
    30: {"name": "بانک قوامین"},
    31: {"name": "بانک سرمایه"},
}
BANK_CODES = {
    "207177": 0,  # توسعه صادرات ایران
    "502229": 1,  # پاسارگاد
    "502806": 2,  # شهر
    "502908": 3,  # توسعه تعاون
    "502910": 4,  # کارآفرین
    "502938": 5,  # دی
    "505416": 6,  # گردشگری
    "505785": 7,  # ایران زمین
    "505801": 8,  # اعتباری کوثر
    "589210": 9,  # سپه
    "589463": 10,  # رفاه کارگران
    "603769": 11,  # صادرات ایران
    "603770": 12,  # کشاورزی
    "603799": 13,  # ملی ایران
    "606373": 14,  # قرض الحسنه مهر ایران
    "610433": 15,  # ملت
    "621986": 16,  # سامان
    "622106": 17,  # پارسیان
    "627353": 18,  # تجارت
    "627381": 19,  # انصار
    "627412": 20,  # اقتصاد نوین
    "627488": 4,  # کارآفرین
    "627648": 0,  # توسعه صادرات ایران
    "627760": 21,  # پست بانک ایران
    "627884": 17,  # پارسیان
    "627961": 22,  # صنعت و معدن
    "628023": 23,  # مسکن
    "628157": 24,  # موسسه اعتباری توسعه
    "636214": 25,  # آینده
    "636795": 26,  # مرکزی
    "636949": 27,  # حکمت ایرانیان
    "639194": 17,  # پارسیان
    "639217": 12,  # کشاورزی
    "639346": 28,  # سینا
    "639347": 1,  # پاسارگاد
    "639370": 29,  # مهر اقتصاد
    "639599": 30,  # قوامین
    "639607": 31,  # سرمایه
    "991975": 15,  # ملت
}


def validate(card_number):
    result = {"is_valid": False}
    temp = 0
    if len(card_number) == 16:
        bank_code = BANK_CODES.get(card_number[:6])
        if bank_code:
            bank_info = BANK_INFO[bank_code]
            card_numbers = list(map(int, card_number))
            for digit in card_numbers[-2::-2]:
                temp += sum(divmod(digit * 2, 10))
            total = sum(card_numbers[::-2]) + temp
            if total % 10 == 0:
                result["is_valid"] = True
                return {**result, **bank_info}
    return result
